In [19]:
# SELECT ALL COLUMNS
import pandas as pd 
 
df = { 
 'Id':[1, 2, 3], 
 'FirstName':['Ali','Sara', 
'Milad'] 
 } 
 
df=pd.DataFrame(df) 
 
df

   Id FirstName
0   1       Ali
1   2      Sara
2   3     Milad

In [ ]:
# SELECT SINGLE COLUMN
import pandas as pd

df = {
    'Id':[1, 2, 3],
    'FirstName':['Ali', 'Sara', 'Milad']
}

df=pd.DataFrame(df)

df['FirstName']

0      Ali
1     Sara
2    Milad
Name: FirstName, dtype: object

In [3]:
# SELECT MULTIPLE COLUMNS
df=pd.DataFrame(
    columns= [
        'Id',
        'FirstName'
        'LastName'
    ]
)
df['Id'] = [1,2,3]
df['FirstName'] = ['Ali', 'Sara', 'Milad']
df['LastName'] = ['Ahmadi', 'Mohseni', 'Rahmati']

df[['Id', 'FirstName']]

   Id FirstName
0   1       Ali
1   2      Sara
2   3     Milad

In [20]:
# FILTER ROWS
import pandas as pd

df=pd.DataFrame(
    columns= ['Id','FirstName']
)

df['Id'] = [1,2,3]

df['FirstName'] = ['Ali', 'Sara', 'Milad']

df[df['Id']==2]

   Id FirstName
1   2      Sara

In [21]:
# TOP N ROWS
import pandas as pd

df=pd.DataFrame(
    columns= ['Id','FirstName']
)

df['Id'] = [1,2,3]
df['FirstName'] = ['Ali', 'Sara', 'Milad']

df.head(2)

   Id FirstName
0   1       Ali
1   2      Sara

In [2]:
# DISTINCT VALUES

import pandas as pd

df=pd.DataFrame(
    columns= ['Id','FirstName', 'LastName']
)

df['Id'] = [1,2,1]
df['FirstName'] = ['Ali', 'Sara', 'Ali']
df['LastName'] = ['Ahmadi', 'Mohseni', 'Rahmati']

print(df)

   Id FirstName LastName
0   1       Ali   Ahmadi
1   2      Sara  Mohseni
2   1       Ali  Rahmati

In [3]:
# print( df.Id.unique())
df[['Id','FirstName']].drop_duplicates()

   Id FirstName
0   1       Ali
1   2      Sara

In [32]:
# COUNT OF DISTINCT VALUES

import pandas as pd

df=pd.DataFrame(
    columns= ['Id','FirstName']
)

df['Id'] = [1,2,1,3]
df['FirstName'] = ['Ali', 'Sara', 'Milad','Banafshe']
print(df)

   Id FirstName
0   1       Ali
1   2      Sara
2   1     Milad
3   3  Banafshe

In [33]:
df[['Id']].nunique()

Id    3
dtype: int64

In [ ]:
# STRUCTURE OF TABLE
import pandas as pd

df=pd.DataFrame(
    columns= ['Id','FirstName']
)

df['Id'] = [1,2,1]
df['FirstName'] = ['Ali', 'Sara', 'Milad']
# print(df)
df.size
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Id         3 non-null      int64
 1   FirstName  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [34]:
# DESCRIPTIVE STATISTICS
import pandas as pd

df=pd.DataFrame(
    columns= ['FirstName', 'Age']
)


df['FirstName'] = ['Ali', 'Sara', 'Milad','Banafshe']
df['Age'] = [18,15,20,19]
print(df)
df.describe()

  FirstName  Age
0       Ali   18
1      Sara   15
2     Milad   20
3  Banafshe   19

             Age
count   4.000000
mean   18.000000
std     2.160247
min    15.000000
25%    17.250000
50%    18.500000
75%    19.250000
max    20.000000

In [ ]:
# GROUP BY SINGLE COLUMN
import pandas as pd
df = {
    'Gender':['M', 'F', 'F', 'M'],
    'Population':[5, 1, 7, 4]
}

df=pd.DataFrame(df)
print(df)
df.groupby('Gender').sum()

  Gender  Population
0      M           5
1      F           1
2      F           7
3      M           4

        Population
Gender
F                8
M                9

In [6]:
df.groupby('Gender').sum()

        Population
Gender
F                8
M                9

In [1]:
# SORT BY SINGLE COLUMN
import pandas as pd
df = {
    'Id':[5, 8, 1, 3],
    'FirstName':['Ali', 'Sara',
                  'Banafshe', 'Milad'],
    'Age':[20, 25, 27 ,18]
}

df=pd.DataFrame(df)
df.sort_values(by='Id')

   Id FirstName  Age
2   1  Banafshe   27
3   3     Milad   18
0   5       Ali   20
1   8      Sara   25

In [2]:
import pandas as pd
df = {
    'Id':[5, 8, 1, 1],
    'FirstName':['Ali', 'Sara',
                  'Banafshe', 'Milad'],
    'Age':[20, 25, 27 ,18]
}


df=pd.DataFrame(df)
df.sort_values(by=['Id','FirstName'])

   Id FirstName  Age
2   1  Banafshe   27
3   1     Milad   18
0   5       Ali   20
1   8      Sara   25

In [8]:
# COUNT OF UNIQUE VALUES
import pandas as pd
df = {
    'FirstName':['Ali', 'Sara', 'Banafshe'
    , 'Milad','Banafshe'],
    'Age':[20, 25, 27 ,18,28]
}


df=pd.DataFrame(df)
df.value_counts()

FirstName  Age
Ali        20     1
Banafshe   27     1
           28     1
Milad      18     1
Sara       25     1
Name: count, dtype: int64

In [ ]:
# COUNT OF UNIQUE VALUES
import pandas as pd
df = {
    'FirstName':['Ali', 'Sara', 'Banafshe', 'Milad','Banafshe'],
    'Age':[20, 25, 27 ,18,28]
}


df=pd.DataFrame(df)


df['FirstName'].value_counts()

FirstName
Banafshe    2
Ali         1
Sara        1
Milad       1
Name: count, dtype: int64

In [ ]:
# DROP ROW - ALL COLUMNS DUPLICATED
import pandas as pd
df = {
    'Id':[1, 2, 3, 1],
    'FirstName':['Ali', 'Sara'
                 , 'Banafshe', 'Ali']
    
}
df=pd.DataFrame(df)
df

   Id FirstName
0   1       Ali
1   2      Sara
2   3  Banafshe
3   1       Ali

In [11]:
df.drop_duplicates()

   Id FirstName
0   1       Ali
1   2      Sara
2   3  Banafshe

In [ ]:
# DROP ROW - KEY COLUMN DUPLICATED
import pandas as pd
df = {
    'Id':[1, 2, 3, 1],
    'FirstName':['Ali', 'Sara', 'Banafshe', 'Milad']
    
}


df=pd.DataFrame(df)
df

   Id      Name
0   1       Ali
1   2      Sara
2   3  Banafshe
3   1     Milad

In [ ]:
df.drop_duplicates(subset='Id')

   Id      Name
0   1       Ali
1   2      Sara
2   3  Banafshe

In [20]:
df.drop_duplicates(subset='Id', keep='last')

   Id      Name
1   2      Sara
2   3  Banafshe
3   1     Milad

In [14]:
# INNER JOIN
import pandas as pd
df1 = {
    'Id':[1, 2, 3],
    'FirstName':['Ali', 'Sara', 'Milad']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 2, 4],
    'Age':[10, 20, 40]
    
}
df2=pd.DataFrame(df2)
df=pd.merge(df1, df2, on='Id' , how='inner')
df

   Id FirstName  Age
0   1       Ali   10
1   2      Sara   20

In [ ]:
# Left JOIN
import pandas as pd
df1 = {
    'Id':[1, 2, 3],
    'FirstName':['Ali', 'Sara', 'Milad']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 2, 4],
    'Age':[10, 20, 40]
    
}
df2=pd.DataFrame(df2)
df=pd.merge(df1, df2, on='Id' , how='left')
df

   Id   Name   Age
0   1    Ali  10.0
1   2   Sara  20.0
2   3  Milad   NaN

In [4]:
# Right JOIN
df=pd.merge(df1, df2, on='Id' , how='right')
df

   Id  Name  Age
0   1   Ali   10
1   2  Sara   20
2   4   NaN   40

In [5]:
# Full JOIN
df1 = {
    'Id':[1, 2, 3],
    'FirstName':['Ali', 'Sara', 'Milad']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 2, 4],
    'Age':[10, 20, 40]
    
}
df2=pd.DataFrame(df2)
df=pd.merge(df1, df2, on='Id', how= 'outer')
df

   Id   Name   Age
0   1    Ali  10.0
1   2   Sara  20.0
2   3  Milad   NaN
3   4    NaN  40.0

In [ ]:
# CROSS JOIN
import pandas as pd
df1 = {
    'Id':[1, 2],
    'FirstName':['Ali', 'Sara']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 3],
    'Age':[10, 20]
    
}
df2=pd.DataFrame(df2)
df=pd.merge(df1, df2, how= 'cross')
df

SyntaxError: invalid syntax (3694685986.py, line 1)

In [1]:
#############################

In [ ]:
# UNION ALL BY SINGLE COLUMN

import pandas as pd

df1 = {
    'Id':[1, 2],
    'FirstName':['Ali', 'Sara']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 3],
    'FirstName':['Milad', 'Banafshe']
    
}
df2=pd.DataFrame(df2)
df= pd.concat( [df1['FirstName']
                , df2['FirstName']] ,ignore_index=True)

df

0         Ali
1        Sara
2       Milad
3    Banafshe
Name: FirstName, dtype: object

In [11]:
import pandas as pd

df1 = {
    'Id':[1, 2],
    'FirstName':['Ali', 'Sara']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 3],
    'FirstName':['Milad', 'Banafshe']
    
}
df2=pd.DataFrame(df2)

df= pd.concat( [df1, df2] ,ignore_index=True)

df

   Id FirstName
0   1       Ali
1   2      Sara
2   1     Milad
3   3  Banafshe

In [2]:
# UNION BY SINGLE COLUMN

import pandas as pd

df1 = {
    'Id':[1, 2],
    'FirstName':['Ali', 'Sara']
    
}
df1=pd.DataFrame(df1)
df2 = {
    'Id':[1, 3],
    'FirstName':['Ali', 'Maryam']
    
}
df2=pd.DataFrame(df2)
df =  pd.concat([ df1['FirstName'] 
                 , df2['FirstName'] ] , ignore_index=True).drop_duplicates()
df

0       Ali
1      Sara
3    Maryam
Name: FirstName, dtype: object

In [3]:
# UNION BY All COLUMN

df =  pd.concat([ df1 , df2 ] , ignore_index=True).drop_duplicates()
df

   Id FirstName
0   1       Ali
1   2      Sara
3   3    Maryam

In [12]:
### add single column
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam']
}
df= pd.DataFrame(data)
df

   Id    Name
0   1     Ali
1   2   Hasan
2   3  Maryam

In [13]:
df['Age']= [25, 24, 20]
df

   Id    Name  Age
0   1     Ali   25
1   2   Hasan   24
2   3  Maryam   20

In [8]:
### Drop single column
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)
df

   Id FirstName  Age
0   1       Ali   25
1   2     Hasan   24
2   3    Maryam   20

In [9]:
df.drop(['Age'], axis=1, inplace=True)
df

   Id FirstName
0   1       Ali
1   2     Hasan
2   3    Maryam

In [27]:
### Drop Multiple Column
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)
df.drop(['FirstName', 'Age'], axis=1 , inplace=True)
df

   Id
0   1
1   2
2   3

In [30]:
### Rename Column
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age1': [25, 24, 20]
}
df= pd.DataFrame(data)
df.rename(columns={'Age1': 'Age'}, inplace=True)
df

   Id    Name  Age
0   1     Ali   25
1   2   Hasan   24
2   3  Maryam   20

In [36]:
### Rename Column
data= {
    'Id': [1, 2, 3],
    'Nam': ['Ali', 'Hasan', 'Maryam'],
    'Age1': [25, 24, 20]
}
df= pd.DataFrame(data)
df.rename(columns={'Nam':'FirstName','Age1':'Age'}, inplace=True)
df

   Id    Name  Age
0   1     Ali   25
1   2   Hasan   24
2   3  Maryam   20

In [37]:
### UPDATE SINGLE COLUMN SINGLE ROW
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)

df.loc[df['Id']==3, 'FirstName'] =['Sara']
df

   Id   Name  Age
0   1    Ali   25
1   2  Hasan   24
2   3   Sara   20

In [52]:
### UPDATE MULTIPLE COLUMNS SINGLE ROW
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)

df.loc[df['Id']==3, ['FirstName', 'Age'] ]= ['Sara', 23]
df

   Id   Name  Age
0   1    Ali   25
1   2  Hasan   24
2   3   Sara   23

In [60]:
### UPDATE SINGLE COLUMN MULTIPLE ROWS
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)

df.loc[df['Id']==(1,3), 'FirstName' ] = ['Milad', 'Ali']
df

ValueError: operands could not be broadcast together with shapes (3,) (2,)

In [ ]:
### UPDATE SINGLE COLUMN ALL ROWS
data= {
    'Id': [1, 2, 3],
    'FirstName': ['Ali', 'Hasan', 'Maryam'],
    'Age': [25, 24, 20]
}
df= pd.DataFrame(data)
df['Age']=55
df

[[1, 'Ali', 25], [2, 'Hasan', 24], [3, 'Maryam', 20]]

In [18]:
import pandas as pd
data= {
    'Id': [1, 2, 3, 4],
    'FirstName': ['Ali', 'Hasan', 'Maryam', 'Ali'],
    'Age': [25, 24, 20, 15]
}

df= pd.DataFrame(data)
df
firstname = df.groupby('FirstName')
df[['FirstName']].drop_duplicates()
df.aggregate(['sum'])

# data = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3':['h','j','k'] }
# df = pd.DataFrame(data)
# col1_sum = df['col3'].sum()
# print(col1_sum)
# firstname

# firstname = df.groupby('FirstName').agg(a=('Age', 'sum') , cnt=('Age', 'count') )
# firstname

     Id          FirstName  Age
sum  10  AliHasanMaryamAli   84

In [ ]:
import pandas as pd
data= {
    'Id': [1, 2, 3, 4],
    'FirstName': ['Hasan', 'Ali', 'Maryam', 'Ali'],
    'LastName': ['Ahmadi', 'Mohseni', 'Rahmati', 'Lotfi'],
    'Age': [15, 24, 20, 25]
}
df=pd.DataFrame(data)
df.groupby(['FirstName'])['Age'].sum()
df.groupby(['FirstName'])['Age'].mean()
df.groupby(['FirstName','Id'])['Age'].sum().reset_index()
df.groupby(['FirstName','Id'])['Age'].sum()
df.groupby(['FirstName','Id'])['Age'].sum().reset_index(name='Total')

df.groupby(['FirstName'])[['Age','Id']].sum()

df['rnk'] =df.groupby('FirstName')['LastName'].transform(lambda x: x.rank(ascending=True))

df.groupby(['FirstName']).agg( 
    total=('Age','sum'),
    avg = ('Age', 'mean'),
    cnt = ('Age', 'count')
    )
df.aggregate('sum')
df.aggregate(['min','sum','max'])

# df.groupby(['FirstName'], sort=False)['Age'].sum()

KeyError: "Column(s) ['Value'] do not exist"